# Pandas

- https://pandas.pydata.org/pandas-docs/stable/
- https://pandas.pydata.org/pandas-docs/stable/reference/index.html

In [ ]:
from datetime import datetime

import numpy as np
import pandas as pd
from IPython.display import display

In [2]:
print(pd.__version__)
print(np.__version__)

2.2.3
2.2.0

In [4]:
df = pd.read_csv(
    "https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv"
)

In [8]:
len(df)

126314

In [9]:
df.shape

(126314, 23)

In [10]:
df.ndim

2

In [11]:
df.size

2905222

In [12]:
df.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [15]:
df.head(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN

In [17]:
df.tail(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [20]:
print(pd.get_option("display.max.column"))
pd.set_option("display.max.column", None)

20

In [21]:
print(pd.get_option("display.max.column"))

None

In [30]:
df.head(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN

In [42]:
print(1293.2767 - 1300.0)  # losing team
print(1306.7233 - 1300.0)  # winning team

-6.723300000000108
6.723300000000108

In [26]:
df.tail(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.3949,1700.7391,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.7391,1692.0859,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.6349,1822.2881,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

## Data Understanding

In [43]:
df.head(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN

In [44]:
df.shape

(126314, 23)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [46]:
df.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000
mean,31579.000000,0.500000,1988.200374,43.533733,0.063857,102.729982,1495.236055,1495.236055,41.707889,102.729982,1495.236055,1495.236055,0.500000
std,18231.927643,0.500002,17.582309,25.375178,0.244499,14.814845,112.139945,112.461687,10.627332,14.814845,112.139945,112.461687,0.215252
min,1.000000,0.000000,1947.000000,1.000000,0.000000,0.000000,1091.644500,1085.774400,10.152501,0.000000,1091.644500,1085.774400,0.020447
25%,15790.000000,0.000000,1975.000000,22.000000,0.000000,93.000000,1417.237975,1416.994900,34.103035,93.000000,1417.237975,1416.994900,0.327989
50%,31579.000000,0.500000,1990.000000,43.000000,0.000000,103.000000,1500.945550,1500.954400,42.113357,103.000000,1500.945550,1500.954400,0.500000
75%,47368.000000,1.000000,2003.000000,65.000000,0.000000,112.000000,1576.060000,1576.291625,49.635328,112.000000,1576.060000,1576.291625,0.672011
max,63157.000000,1.000000,2015.000000,108.000000,1.000000,186.000000,1853.104500,1853.104500,71.112038,186.000000,1853.104500,1853.104500,0.979553

In [47]:
df.head(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN

### Slicing

In [49]:
df[:5]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0000,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0000,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0000,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.7233,1297.0712,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.0000,1279.6189,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [52]:
df["gameorder"]

0             1
1             1
2             2
3             2
4             3
          ...
126309    63155
126310    63156
126311    63156
126312    63157
126313    63157
Name: gameorder, Length: 126314, dtype: int64

In [57]:
df[["year_id", "date_game"]]

        year_id  date_game
0          1947  11/1/1946
1          1947  11/1/1946
2          1947  11/2/1946
3          1947  11/2/1946
4          1947  11/2/1946
...         ...        ...
126309     2015  6/11/2015
126310     2015  6/14/2015
126311     2015  6/14/2015
126312     2015  6/16/2015
126313     2015  6/16/2015

[126314 rows x 2 columns]

In [ ]:
df.loc[:5, ["year_id", "date_game"]]

   year_id  date_game
0     1947  11/1/1946
1     1947  11/1/1946
2     1947  11/2/1946
3     1947  11/2/1946
4     1947  11/2/1946
5     1947  11/2/1946

In [61]:
df.loc[:5]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0000,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0000,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0000,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.7233,1297.0712,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.0000,1279.6189,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
5,3,194611020DTF,NBA,1,1947,11/2/1946,1,0,WSC,Capitols,50,1300.0000,1320.3811,43.135952,DTF,Falcons,33,1300.0000,1279.6189,A,W,0.359935,NaN

In [71]:
df.loc[:15:2, ["year_id", "date_game"]]

    year_id  date_game
0      1947  11/1/1946
2      1947  11/2/1946
4      1947  11/2/1946
6      1947  11/2/1946
8      1947  11/2/1946
10     1947  11/3/1946
12     1947  11/4/1946
14     1947  11/5/1946

In [73]:
df[["year_id", "date_game"]]

        year_id  date_game
0          1947  11/1/1946
1          1947  11/1/1946
2          1947  11/2/1946
3          1947  11/2/1946
4          1947  11/2/1946
...         ...        ...
126309     2015  6/11/2015
126310     2015  6/14/2015
126311     2015  6/14/2015
126312     2015  6/16/2015
126313     2015  6/16/2015

[126314 rows x 2 columns]

In [74]:
df[["year_id", "date_game"]][:5]

   year_id  date_game
0     1947  11/1/1946
1     1947  11/1/1946
2     1947  11/2/1946
3     1947  11/2/1946
4     1947  11/2/1946

In [ ]:
%%timeit
df.loc[:5, ["year_id", "date_game"]]
# 1 process. filter baris sekaligus column

3.87 ms ± 460 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [ ]:
%%timeit
df[["year_id", "date_game"]][:5]
# 2 process, filter column. Lalu dari hasil tersebut, filter baris

4.33 ms ± 364 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [77]:
df["team_id"]

0         TRH
1         NYK
2         CHS
3         NYK
4         DTF
         ...
126309    CLE
126310    GSW
126311    CLE
126312    CLE
126313    GSW
Name: team_id, Length: 126314, dtype: object

In [78]:
df["team_id"].unique()

array(['TRH', 'NYK', 'CHS', 'DTF', 'WSC', 'BOS', 'PRO', 'PIT', 'STB',
       'CLR', 'PHW', 'BLB', 'INJ', 'FTW', 'MNL', 'ROC', 'TRI', 'DNN',
       'INO', 'SHE', 'WAT', 'AND', 'SYR', 'MLH', 'STL', 'DET', 'CIN',
       'LAL', 'CHP', 'CHZ', 'SFW', 'BAL', 'PHI', 'CHI', 'SEA', 'OAK',
       'ANA', 'SDR', 'KEN', 'INA', 'DNR', 'DLC', 'HSM', 'NOB', 'MNM',
       'NJA', 'PTP', 'ATL', 'MIL', 'PHO', 'NYA', 'MMF', 'MNP', 'LAS',
       'CAR', 'WSA', 'BUF', 'CLE', 'UTS', 'FLO', 'PTC', 'POR', 'VIR',
       'TEX', 'MMP', 'HOU', 'GSW', 'KCO', 'MMT', 'SDA', 'CAP', 'SAA',
       'NOJ', 'DNA', 'SSL', 'MMS', 'WSB', 'KCK', 'SDS', 'IND', 'NYN',
       'DEN', 'SAS', 'NJN', 'SDC', 'UTA', 'DAL', 'LAC', 'SAC', 'CHH',
       'MIA', 'MIN', 'ORL', 'VAN', 'TOR', 'WAS', 'MEM', 'NOH', 'CHA',
       'NOK', 'OKC', 'BRK', 'NOP', 'CHO'], dtype=object)

In [79]:
df["team_id"].nunique()

104

In [88]:
team_list = df["team_id"].unique().tolist()
team_occurence_list = df["team_id"].to_list()
team_occurence_list.count("TRH")

60

In [90]:
len(team_list)

104

In [92]:
len(team_occurence_list)

126314

In [96]:
count = 0
for team in team_occurence_list:
    if team == "TRH":
        count = count + 1
print("TRH", count)

TRH 60

In [97]:
count = 0
for team in team_occurence_list:
    if team == "NYK":
        count = count + 1
print("NYK", count)

NYK 5769

In [103]:
team_id = "DTF"
count = 0
for team in team_occurence_list:
    if team == team_id:
        count = count + 1
print(team_id, count)

DTF 60

In [104]:
team_id = "TRH"
count = 0
for team in team_occurence_list:
    if team == team_id:
        count = count + 1
print(team_id, count)

TRH 60

In [105]:
team_id = "NYK"
count = 0
for team in team_occurence_list:
    if team == team_id:
        count = count + 1
print(team_id, count)

NYK 5769

In [ ]:
def count_occurence(team_id):
    count = 0
    for team in team_occurence_list:
        if team == team_id:
            count = count + 1
    return (team_id, count)

In [114]:
count_occurence("TRH")

TRH 60

In [115]:
count_occurence("NYK")

NYK 5769

In [117]:
count_occurence("DTF")

DTF 60

In [123]:
results = []
for team in team_list:
    results.append(count_occurence(team))

In [125]:
results[:5]

[('TRH', 60), ('NYK', 5769), ('CHS', 260), ('DTF', 60), ('WSC', 291)]

In [137]:
team_occurence_list = df["team_id"].to_list()
team_list = set(team_occurence_list)


def count_occurence(team_id, team_occurence_list):
    count = 0
    for team in team_occurence_list:
        if team == team_id:
            count = count + 1
    return (team_id, count)


results = []
for team in team_list:
    results.append(count_occurence(team, team_occurence_list))

print(results[:5])

[('NOB', 268), ('TOR', 1634), ('NJA', 78), ('CLR', 63), ('GSW', 3701)]

In [139]:
df["team_id"].value_counts()

team_id
BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
PIT      60
INJ      60
TRH      60
DTF      60
SDS      11
Name: count, Length: 104, dtype: int64

In [145]:
df[["year_id", "team_id"]][:10:2]

   year_id team_id
0     1947     TRH
2     1947     CHS
4     1947     DTF
6     1947     BOS
8     1947     PIT

In [149]:
df["team_id"].value_counts()[:5]

team_id
BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
Name: count, dtype: int64

In [150]:
df["fran_id"].value_counts()[:5]

fran_id
Lakers      6024
Celtics     5997
Knicks      5769
Warriors    5657
Pistons     5650
Name: count, dtype: int64

In [156]:
df[:5]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0000,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0000,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0000,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.7233,1297.0712,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.0000,1279.6189,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [163]:
df.loc[df["fran_id"] == "Lakers", ["team_id", "fran_id"]]

       team_id fran_id
1136       MNL  Lakers
1152       MNL  Lakers
1159       MNL  Lakers
1170       MNL  Lakers
1183       MNL  Lakers
...        ...     ...
126016     LAL  Lakers
126052     LAL  Lakers
126086     LAL  Lakers
126115     LAL  Lakers
126137     LAL  Lakers

[6024 rows x 2 columns]

In [168]:
df.loc[df["fran_id"] == "Lakers", "team_id"].value_counts()

team_id
LAL    5078
MNL     946
Name: count, dtype: int64

In [170]:
df.loc[df["team_id"] == "MNL", "date_game"]

1136     11/4/1948
1152     11/6/1948
1159     11/9/1948
1170    11/11/1948
1183    11/13/1948
           ...
9701     3/19/1960
9702     3/20/1960
9709     3/22/1960
9711     3/24/1960
9715     3/26/1960
Name: date_game, Length: 946, dtype: object

In [ ]:
df.loc[df["team_id"] == "MNL", "date_game"].min()

'1/1/1949'

In [175]:
"a" > "1"

True

In [176]:
"A" > "a"

False

In [177]:
"0" > "!"

True

In [ ]:
"!@#%...0123456789abcdefg......ABCDE...emoji"

In [ ]:
df.loc[df["team_id"] == "MNL", "date_game"]

1136     11/4/1948
1152     11/6/1948
1159     11/9/1948
1170    11/11/1948
1183    11/13/1948
           ...
9701     3/19/1960
9702     3/20/1960
9709     3/22/1960
9711     3/24/1960
9715     3/26/1960
Name: date_game, Length: 946, dtype: object

In [ ]:
print("11/4/1948" < "3/19/1960")
print("11/4/1948"[0])
print("3/19/1960"[0])
print("-" * 10)
print("11/4/1948"[1])
print("3/19/1960"[1])

True
1
3
----------
1
/

In [184]:
df.loc[df["team_id"] == "MNL", "date_game"].min()

'1/1/1949'

In [190]:
print(datetime(2024, 10, 1))
display(datetime(2024, 10, 1))

2024-10-01 00:00:00

datetime.datetime(2024, 10, 1, 0, 0)

In [191]:
datetime(2024, 10, 1) < datetime(1998, 6, 5)

False

In [194]:
df["date_game"]

0         11/1/1946
1         11/1/1946
2         11/2/1946
3         11/2/1946
4         11/2/1946
            ...
126309    6/11/2015
126310    6/14/2015
126311    6/14/2015
126312    6/16/2015
126313    6/16/2015
Name: date_game, Length: 126314, dtype: object

In [193]:
pd.to_datetime(df["date_game"])

0        1946-11-01
1        1946-11-01
2        1946-11-02
3        1946-11-02
4        1946-11-02
            ...
126309   2015-06-11
126310   2015-06-14
126311   2015-06-14
126312   2015-06-16
126313   2015-06-16
Name: date_game, Length: 126314, dtype: datetime64[ns]

In [196]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [195]:
df["date_game"]

0         11/1/1946
1         11/1/1946
2         11/2/1946
3         11/2/1946
4         11/2/1946
            ...
126309    6/11/2015
126310    6/14/2015
126311    6/14/2015
126312    6/16/2015
126313    6/16/2015
Name: date_game, Length: 126314, dtype: object

In [197]:
df["date_game"] = pd.to_datetime(df["date_game"])

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  datetime64[ns]
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: datetime64[ns](1), float64(6), int64(7), object(9)
memory usage: 22.2+ MB

In [199]:
df["date_game"]

0        1946-11-01
1        1946-11-01
2        1946-11-02
3        1946-11-02
4        1946-11-02
            ...
126309   2015-06-11
126310   2015-06-14
126311   2015-06-14
126312   2015-06-16
126313   2015-06-16
Name: date_game, Length: 126314, dtype: datetime64[ns]

In [201]:
df.loc[df["team_id"] == "MNL", "date_game"].head()

1136   1948-11-04
1152   1948-11-06
1159   1948-11-09
1170   1948-11-11
1183   1948-11-13
Name: date_game, dtype: datetime64[ns]

In [200]:
df.loc[df["team_id"] == "MNL", "date_game"].min()

Timestamp('1948-11-04 00:00:00')

In [202]:
df.loc[df["team_id"] == "MNL", "date_game"].sort_values()

1136   1948-11-04
1152   1948-11-06
1159   1948-11-09
1170   1948-11-11
1183   1948-11-13
          ...
9701   1960-03-19
9702   1960-03-20
9709   1960-03-22
9711   1960-03-24
9715   1960-03-26
Name: date_game, Length: 946, dtype: datetime64[ns]

In [204]:
df["date_game"].describe()

count                           126314
mean     1988-04-09 00:53:18.429311104
min                1946-11-01 00:00:00
25%                1974-11-08 00:00:00
50%                1990-02-06 00:00:00
75%                2003-03-19 00:00:00
max                2015-06-16 00:00:00
Name: date_game, dtype: object

In [218]:
df.loc[df["team_id"] == "MNL", "pts"].sum()

np.int64(88229)

### Pandas data structure

In [220]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  datetime64[ns]
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: datetime64[ns](1), float64(6), int64(7), object(9)
memory usage: 22.2+ MB

In [222]:
df["team_id"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 126314 entries, 0 to 126313
Series name: team_id
Non-Null Count   Dtype
--------------   -----
126314 non-null  object
dtypes: object(1)
memory usage: 987.0+ KB

In [224]:
print(type(df))
print(type(df["team_id"]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [227]:
df.loc[:20, ["team_id", "fran_id"]].T

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20
team_id,TRH,NYK,CHS,NYK,DTF,WSC,BOS,PRO,PIT,STB,TRH,CLR,PIT,WSC,BOS,CHS,STB,DTF,PIT,PHW,PRO
fran_id,Huskies,Knicks,Stags,Knicks,Falcons,Capitols,Celtics,Steamrollers,Ironmen,Bombers,Huskies,Rebels,Ironmen,Capitols,Celtics,Stags,Bombers,Falcons,Ironmen,Warriors,Steamrollers

In [230]:
df["team_id"].T

0         TRH
1         NYK
2         CHS
3         NYK
4         DTF
         ...
126309    CLE
126310    GSW
126311    CLE
126312    CLE
126313    GSW
Name: team_id, Length: 126314, dtype: object

In [242]:
df.nunique()

gameorder         63157
game_id           63157
lg_id                 2
_iscopy               2
year_id              69
date_game         12426
seasongame          108
is_playoffs           2
team_id             104
fran_id              53
pts                 139
elo_i            123947
elo_n            123982
win_equiv        123857
opp_id              104
opp_fran             53
opp_pts             139
opp_elo_i        123947
opp_elo_n        123982
game_location         3
game_result           2
forecast         125039
notes               231
dtype: int64

In [238]:
df["team_id"].nunique()

104

In [243]:
df["team_id"].unique()

array(['TRH', 'NYK', 'CHS', 'DTF', 'WSC', 'BOS', 'PRO', 'PIT', 'STB',
       'CLR', 'PHW', 'BLB', 'INJ', 'FTW', 'MNL', 'ROC', 'TRI', 'DNN',
       'INO', 'SHE', 'WAT', 'AND', 'SYR', 'MLH', 'STL', 'DET', 'CIN',
       'LAL', 'CHP', 'CHZ', 'SFW', 'BAL', 'PHI', 'CHI', 'SEA', 'OAK',
       'ANA', 'SDR', 'KEN', 'INA', 'DNR', 'DLC', 'HSM', 'NOB', 'MNM',
       'NJA', 'PTP', 'ATL', 'MIL', 'PHO', 'NYA', 'MMF', 'MNP', 'LAS',
       'CAR', 'WSA', 'BUF', 'CLE', 'UTS', 'FLO', 'PTC', 'POR', 'VIR',
       'TEX', 'MMP', 'HOU', 'GSW', 'KCO', 'MMT', 'SDA', 'CAP', 'SAA',
       'NOJ', 'DNA', 'SSL', 'MMS', 'WSB', 'KCK', 'SDS', 'IND', 'NYN',
       'DEN', 'SAS', 'NJN', 'SDC', 'UTA', 'DAL', 'LAC', 'SAC', 'CHH',
       'MIA', 'MIN', 'ORL', 'VAN', 'TOR', 'WAS', 'MEM', 'NOH', 'CHA',
       'NOK', 'OKC', 'BRK', 'NOP', 'CHO'], dtype=object)

In [244]:
df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [246]:
len(dir(pd.DataFrame))

437

In [249]:
len(dir(pd.Series))

419

In [251]:
df.columns

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [252]:
df.index

RangeIndex(start=0, stop=126314, step=1)

In [256]:
df[:30:3].index

RangeIndex(start=0, stop=30, step=3)

In [258]:
df["team_id"].index

RangeIndex(start=0, stop=126314, step=1)

In [263]:
profile = {"name": "john", "age": 19, "hobby": "basketball"}
"john" in profile

False

In [266]:
for i in profile:
    print(i)

name
age
hobby

In [265]:
"name" in profile

True

In [267]:
for i in profile.keys():
    print(i)

name
age
hobby

In [268]:
for i in profile.values():
    print(i)

john
19
basketball

In [269]:
for i in profile.items():
    print(i)

('name', 'john')
('age', 19)
('hobby', 'basketball')

In [271]:
for k, v in profile.items():
    print(k, ":", v)

name : john
age : 19
hobby : basketball

In [273]:
"gameorder" in df.columns

True

In [274]:
"gameorder" in df

True

In [275]:
for i in df:
    print(i)

gameorder
game_id
lg_id
_iscopy
year_id
date_game
seasongame
is_playoffs
team_id
fran_id
pts
elo_i
elo_n
win_equiv
opp_id
opp_fran
opp_pts
opp_elo_i
opp_elo_n
game_location
game_result
forecast
notes

In [292]:
df_sample = df.loc[:5, ["gameorder", "team_id", "fran_id", "pts"]]

In [293]:
df_sample

   gameorder team_id   fran_id  pts
0          1     TRH   Huskies   66
1          1     NYK    Knicks   68
2          2     CHS     Stags   63
3          2     NYK    Knicks   47
4          3     DTF   Falcons   33
5          3     WSC  Capitols   50

In [305]:
df_sample.to_dict("list")

{'gameorder': [1, 1, 2, 2, 3, 3],
 'team_id': ['TRH', 'NYK', 'CHS', 'NYK', 'DTF', 'WSC'],
 'fran_id': ['Huskies', 'Knicks', 'Stags', 'Knicks', 'Falcons', 'Capitols'],
 'pts': [66, 68, 63, 47, 33, 50]}

In [312]:
df_sample.to_dict("records")

[{'gameorder': 1, 'team_id': 'TRH', 'fran_id': 'Huskies', 'pts': 66},
 {'gameorder': 1, 'team_id': 'NYK', 'fran_id': 'Knicks', 'pts': 68},
 {'gameorder': 2, 'team_id': 'CHS', 'fran_id': 'Stags', 'pts': 63},
 {'gameorder': 2, 'team_id': 'NYK', 'fran_id': 'Knicks', 'pts': 47},
 {'gameorder': 3, 'team_id': 'DTF', 'fran_id': 'Falcons', 'pts': 33},
 {'gameorder': 3, 'team_id': 'WSC', 'fran_id': 'Capitols', 'pts': 50}]

In [313]:
df_sample

   gameorder team_id   fran_id  pts
0          1     TRH   Huskies   66
1          1     NYK    Knicks   68
2          2     CHS     Stags   63
3          2     NYK    Knicks   47
4          3     DTF   Falcons   33
5          3     WSC  Capitols   50

In [320]:
df.loc[[6, 1238], ["game_id", "team_id"]]

           game_id team_id
6     194611020PRO     BOS
1238  194811230ROC     BLB

In [324]:
df.columns

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [325]:
df.iloc[:, 2:5]

       lg_id  _iscopy  year_id
0        NBA        0     1947
1        NBA        1     1947
2        NBA        0     1947
3        NBA        1     1947
4        NBA        0     1947
...      ...      ...      ...
126309   NBA        0     2015
126310   NBA        0     2015
126311   NBA        1     2015
126312   NBA        0     2015
126313   NBA        1     2015

[126314 rows x 3 columns]

In [328]:
df_steps = df[5::5]

In [338]:
df_steps.loc[5]

gameorder                          3
game_id                 194611020DTF
lg_id                            NBA
_iscopy                            1
year_id                         1947
date_game        1946-11-02 00:00:00
seasongame                         1
is_playoffs                        0
team_id                          WSC
fran_id                     Capitols
pts                               50
elo_i                         1300.0
elo_n                      1320.3811
win_equiv                  43.135952
opp_id                           DTF
opp_fran                     Falcons
opp_pts                           33
opp_elo_i                     1300.0
opp_elo_n                  1279.6189
game_location                      A
game_result                        W
forecast                    0.359935
notes                            NaN
Name: 5, dtype: object

In [336]:
df_steps.iloc[0]

gameorder                          3
game_id                 194611020DTF
lg_id                            NBA
_iscopy                            1
year_id                         1947
date_game        1946-11-02 00:00:00
seasongame                         1
is_playoffs                        0
team_id                          WSC
fran_id                     Capitols
pts                               50
elo_i                         1300.0
elo_n                      1320.3811
win_equiv                  43.135952
opp_id                           DTF
opp_fran                     Falcons
opp_pts                           33
opp_elo_i                     1300.0
opp_elo_n                  1279.6189
game_location                      A
game_result                        W
forecast                    0.359935
notes                            NaN
Name: 5, dtype: object

In [339]:
df_steps.iloc[2:5]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
15,8,194611050BOS,NBA,1,1947,1946-11-05,2,0,CHS,Stags,57,1309.6521,1316.0840,42.686188,BOS,Celtics,55,1294.8458,1288.4139,A,W,0.379796,NaN
20,11,194611070PRO,NBA,0,1947,1946-11-07,2,0,PRO,Steamrollers,73,1305.1542,1311.5032,42.206284,CHS,Stags,65,1316.0840,1309.7350,H,W,0.625446,NaN
25,13,194611080TRH,NBA,1,1947,1946-11-08,3,0,DTF,Falcons,71,1271.4624,1268.4468,37.697380,TRH,Huskies,73,1286.1534,1289.1691,A,L,0.340691,NaN

In [342]:
df_steps.loc[2:5]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
5,3,194611020DTF,NBA,1,1947,1946-11-02,1,0,WSC,Capitols,50,1300.0,1320.3811,43.135952,DTF,Falcons,33,1300.0,1279.6189,A,W,0.359935,NaN

In [344]:
for i in df_steps:
    print(i)

gameorder
game_id
lg_id
_iscopy
year_id
date_game
seasongame
is_playoffs
team_id
fran_id
pts
elo_i
elo_n
win_equiv
opp_id
opp_fran
opp_pts
opp_elo_i
opp_elo_n
game_location
game_result
forecast
notes

In [343]:
df_steps[0]

KeyError: 0

In [345]:
df_steps[0:5]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
5,3,194611020DTF,NBA,1,1947,1946-11-02,1,0,WSC,Capitols,50,1300.0000,1320.3811,43.135952,DTF,Falcons,33,1300.0000,1279.6189,A,W,0.359935,NaN
10,6,194611030CLR,NBA,1,1947,1946-11-03,2,0,TRH,Huskies,60,1293.2767,1286.1534,39.548164,CLR,Rebels,71,1300.0000,1307.1233,A,L,0.351068,NaN
15,8,194611050BOS,NBA,1,1947,1946-11-05,2,0,CHS,Stags,57,1309.6521,1316.0840,42.686188,BOS,Celtics,55,1294.8458,1288.4139,A,W,0.379796,NaN
20,11,194611070PRO,NBA,0,1947,1946-11-07,2,0,PRO,Steamrollers,73,1305.1542,1311.5032,42.206284,CHS,Stags,65,1316.0840,1309.7350,H,W,0.625446,NaN
25,13,194611080TRH,NBA,1,1947,1946-11-08,3,0,DTF,Falcons,71,1271.4624,1268.4468,37.697380,TRH,Huskies,73,1286.1534,1289.1691,A,L,0.340691,NaN

In [346]:
df_steps[["game_id", "lg_id"]]

             game_id lg_id
5       194611020DTF   NBA
10      194611030CLR   NBA
15      194611050BOS   NBA
20      194611070PRO   NBA
25      194611080TRH   NBA
...              ...   ...
126290  201505220ATL   NBA
126295  201505240CLE   NBA
126300  201505270GSW   NBA
126305  201506070GSW   NBA
126310  201506140GSW   NBA

[25262 rows x 2 columns]

In [347]:
df_steps[:5, ["game_id", "lg_id"]]

InvalidIndexError: (slice(None, 5, None), ['game_id', 'lg_id'])

In [348]:
df_steps.loc[:5, ["game_id", "lg_id"]]

        game_id lg_id
5  194611020DTF   NBA

In [ ]:
df_steps.iloc[:5, [1, 2]]

         game_id lg_id
5   194611020DTF   NBA
10  194611030CLR   NBA
15  194611050BOS   NBA
20  194611070PRO   NBA
25  194611080TRH   NBA

In [352]:
df_steps.iloc[:5][["game_id", "lg_id"]]

         game_id lg_id
5   194611020DTF   NBA
10  194611030CLR   NBA
15  194611050BOS   NBA
20  194611070PRO   NBA
25  194611080TRH   NBA

In [356]:
df.columns.tolist().index("lg_id")

2

In [355]:
df.iloc[:5, df.columns.tolist().index("lg_id")]

0    NBA
1    NBA
2    NBA
3    NBA
4    NBA
Name: lg_id, dtype: object

In [357]:
df.iloc[:5]["lg_id"]

0    NBA
1    NBA
2    NBA
3    NBA
4    NBA
Name: lg_id, dtype: object

### Query

In [360]:
df[df["team_id"] == "MNL"]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
1136,569,194811040BLB,NBA,1,1949,1948-11-04,1,0,MNL,Lakers,84,1527.0000,1542.2545,51.218754,BLB,Baltimore,72,1507.2052,1491.9507,A,W,0.386583,NaN
1152,577,194811060WSC,NBA,1,1949,1948-11-06,2,0,MNL,Lakers,62,1542.2545,1536.2078,50.621624,WSC,Capitols,67,1481.8721,1487.9188,A,L,0.443232,NaN
1159,580,194811090BOS,NBA,1,1949,1948-11-09,3,0,MNL,Lakers,55,1536.2078,1513.4880,48.341133,BOS,Celtics,77,1359.3345,1382.0542,A,L,0.608859,NaN
1170,586,194811110NYK,NBA,1,1949,1948-11-11,4,0,MNL,Lakers,77,1513.4880,1524.9596,49.499451,NYK,Knicks,68,1460.4232,1448.9517,A,W,0.432863,NaN
1183,592,194811130PRO,NBA,1,1949,1948-11-13,5,0,MNL,Lakers,90,1524.9596,1533.2726,50.330185,PRO,Steamrollers,67,1245.9456,1237.6326,A,W,0.737010,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9701,4851,196003190LAL,NBA,0,1960,1960-03-19,80,1,MNL,Lakers,89,1471.0741,1464.6069,36.052319,STL,Hawks,93,1564.9653,1571.4325,H,L,0.508790,NaN
9702,4852,196003200LAL,NBA,0,1960,1960-03-20,81,1,MNL,Lakers,103,1464.6069,1469.5608,36.565147,STL,Hawks,101,1571.4325,1566.4786,H,W,0.490179,NaN
9709,4855,196003220STL,NBA,1,1960,1960-03-22,82,1,MNL,Lakers,117,1469.5608,1484.6693,38.137211,STL,Hawks,110,1566.4786,1551.3701,A,W,0.243506,NaN
9711,4856,196003240LAL,NBA,0,1960,1960-03-24,83,1,MNL,Lakers,96,1484.6693,1465.5942,36.154404,STL,Hawks,117,1551.3701,1570.4452,H,L,0.547775,NaN
9715,4858,196003260STL,NBA,1,1960,1960-03-26,84,1,MNL,Lakers,86,1465.5942,1461.1439,35.694744,STL,Hawks,97,1570.4452,1574.8955,A,L,0.235193,NaN

In [368]:
df[(df["year_id"] > 1950) & (df["year_id"] < 1990)]["team_id"]

3076     WSC
3077     ROC
3078     MNL
3079     BLB
3080     BOS
        ...
61917    LAL
61918    LAL
61919    DET
61920    LAL
61921    DET
Name: team_id, Length: 58846, dtype: object

In [369]:
df[(df["year_id"] > 1950) & (df["year_id"] < 1990) & (df["pts"] > 100)]["team_id"]

3081     FTW
3089     BLB
3138     INO
3168     WSC
3178     TRI
        ...
61916    DET
61917    LAL
61918    LAL
61919    DET
61921    DET
Name: team_id, Length: 42495, dtype: object

### Group By

In [ ]:
# from df
# group by fran_id
# select avg(pts)

In [373]:
df.groupby("fran_id")["pts"].mean()

fran_id
Baltimore        79.698073
Bombers          71.457831
Bucks           103.700050
Bulls           101.525192
Capitols         76.931271
Cavaliers        99.846719
Celtics         104.466233
Clippers        101.934905
Colonels        111.625296
Condors         115.446512
Denver           77.709677
Falcons          63.283333
Floridians      112.654545
Grizzlies        95.161738
Hawks           101.805635
Heat             96.627162
Hornets          94.506711
Huskies          66.583333
Ironmen          61.233333
Jazz            102.153305
Jets             74.700000
Kings           103.971689
Knicks          100.970185
Lakers          105.817397
Magic            99.427277
Mavericks       102.634915
Nets            101.755723
Nuggets         108.199029
Olympians        81.078014
Pacers          103.687722
Packers          86.013889
Pelicans         97.956522
Pistons         101.373097
Raptors          96.921665
Rebels           71.015873
Redskins         82.646154
Rockets         104.117477
Sails           109.781022
Sixers          103.807760
Sounds          108.439024
Spirits         110.519949
Spurs           105.319564
Squires         114.051314
Stags            78.453846
Stars           112.354497
Steamrollers     73.642857
Suns            107.226961
Thunder         104.771422
Timberwolves     97.462694
Trailblazers    104.055556
Warriors        104.511932
Waterloo         79.370968
Wizards         103.624836
Name: pts, dtype: float64

In [374]:
df.groupby("fran_id")["pts"].agg(["mean", "min", "max"])

                    mean  min  max
fran_id
Baltimore      79.698073   50  126
Bombers        71.457831   46  109
Bucks         103.700050   56  166
Bulls         101.525192   49  156
Capitols       76.931271   38  118
Cavaliers      99.846719   57  154
Celtics       104.466233   43  173
Clippers      101.934905   63  152
Colonels      111.625296   75  157
Condors       115.446512   75  156
Denver         77.709677   51  108
Falcons        63.283333   33   92
Floridians    112.654545   79  160
Grizzlies      95.161738   62  144
Hawks         101.805635   46  155
Heat           96.627162   54  141
Hornets        94.506711   59  133
Huskies        66.583333   40   93
Ironmen        61.233333   40   85
Jazz          102.153305   54  153
Jets           74.700000   53  110
Kings         103.971689   53  165
Knicks        100.970185   45  152
Lakers        105.817397   18  162
Magic          99.427277   56  155
Mavericks     102.634915   62  156
Nets          101.755723   56  166
Nuggets       108.199029    0  184
Olympians      81.078014   52  112
Pacers        103.687722   55  177
Packers        86.013889   50  123
Pelicans       97.956522   62  141
Pistons       101.373097   19  186
Raptors        96.921665   56  136
Rebels         71.015873   44   92
Redskins       82.646154   59  141
Rockets       104.117477   66  156
Sails         109.781022   76  176
Sixers        103.807760   57  163
Sounds        108.439024   80  146
Spirits       110.519949   80  156
Spurs         105.319564   64  171
Squires       114.051314    2  169
Stags          78.453846   48  115
Stars         112.354497   68  154
Steamrollers   73.642857   53  107
Suns          107.226961   65  173
Thunder       104.771422   65  154
Timberwolves   97.462694   61  143
Trailblazers  104.055556   58  156
Warriors      104.511932   47  169
Waterloo       79.370968   59  104
Wizards       103.624836   63  161

In [ ]:
df.groupby("fran_id")["pts"].agg(["mean", "min", "max"]).sort_values(
    "mean", ascending=False
)[:5]

                  mean  min  max
fran_id
Condors     115.446512   75  156
Squires     114.051314    2  169
Floridians  112.654545   79  160
Stars       112.354497   68  154
Colonels    111.625296   75  157